Revit 2027 API
IFCData.AsInteger Method
 Gets storage value as integer when its PrimitiveType is integer.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int AsInteger()
Public Function AsInteger As Integer
public:
int AsInteger()
member AsInteger : unit -> int
Return Value
Int32
 The int value.
Exceptions
Exception | Condition
InapplicableDataException |  The primitive type is not integer.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace